# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [7]:
import sqlite3
import pandas as pd

In [8]:
conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

In [9]:
#display method with columns from pandas
def display_table(statement):
    c.execute(statement)
    df = pd.DataFrame(c.fetchall())
    df.columns = [i[0] for i in c.description]
    return df.head()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [10]:
statement = """SELECT customerNumber,
                        contactLastName,
                        contactFirstName
                        FROM customers
                        WHERE customerNumber in (SELECT customerNumber
                                                FROM orders 
                                                WHERE orderDate = '2003-01-31');"""
display_table(statement)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [17]:
statement =  """SELECT productName, 
                COUNT(distinct orderNumber) AS numberOrders,
                SUM(quantityOrdered) AS totalUnitsSold
                FROM products
                JOIN orderDetails
                USING(productCode)
                GROUP BY 1
                ORDER BY totalUnitsSold
            """

display_table(statement)

                        productName  numberOrders  totalUnitsSold
0             1957 Ford Thunderbird            24             767
1        1970 Chevy Chevelle SS 454            25             803
2  1936 Mercedes Benz 500k Roadster            25             824
3                1911 Ford Town Car            25             832
4      1999 Indy 500 Monte Carlo SS            25             855

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [23]:
total_product_orders = """SELECT productName,
                COUNT(distinct customerNumber) AS totalCustomers
                FROM products
                JOIN orderDetails
                USING(productCode)
                JOIN orders
                USING(orderNumber)
                GROUP BY 1
                ORDER BY totalCustomers DESC
                
"""

display_table(total_product_orders)

                   productName  totalCustomers
0  1992 Ferrari 360 Spider red              40
1           1934 Ford V8 Coupe              27
2     1952 Alpine Renault 1300              27
3          1972 Alfa Romeo GTA              27
4             Boeing X-32A JSF              27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
less_than_20

In [ ]:
statement = """SELECT employeeNumber, officeCode, city, firstName, lastName
                FROM employees
            """

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!